
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/YamatoKato/st-ecs/actions/runs/11433420294)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02b5681a4f3c1ab51]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f343a194803308d3]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06652e693df02ece1]
aws_security_group.ecs: Refreshing state... [id=sg-00f732263e7b7cfbb]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c4e9191b86bacf1f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01e1db035ad93125b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00f52ada72fadaee0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ad00feb61c4acad5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f011103d12fdb225]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-085c4da19a9dd999a]
aws_security_group.alb: Refreshing state... [id=sg-0a225dea71e25bef2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07e0f7d85c7dcf1cc]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e4f35268f7682c44]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0db9d38d0fa6b6e5e]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-939008187]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ebf2d5ecb1d9d0b0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0402c5a94e6c4dd21]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-025e9202f0fa47407]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-026a1d9efb454c7c3]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04105bc1ccc282a1c]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07157bb44b77124e9]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f343a194803308d31080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0649c434aebf2f5d3]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a9826f32ca19b694]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07e0f7d85c7dcf1cc1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e4f35268f7682c441080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "st-go-web-dev-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0a225dea71e25bef2",
        ]
      + subnets                                                      = [
          + "subnet-085c4da19a9dd999a",
          + "subnet-0ad00feb61c4acad5",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "st-go-web-dev-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-02b5681a4f3c1ab51"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:targetgroup/st-go-web-dev-target-group/76d1e770453f2275]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Still creating... [3m0s elapsed]
aws_lb.alb: Still creating... [3m10s elapsed]
aws_lb.alb: Still creating... [3m20s elapsed]
aws_lb.alb: Creation complete after 3m25s [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:loadbalancer/app/st-go-web-dev-alb/4e29a4c69e8b70f0]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:listener/app/st-go-web-dev-alb/4e29a4c69e8b70f0/78a31869aa31e28a]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:listener-rule/app/st-go-web-dev-alb/4e29a4c69e8b70f0/78a31869aa31e28a/24e6998cd93abdbd]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":9,"Program":"tfcmt","SHA1":"5202fc4a781dba3d960f51fb12ae874b73ae15d0","Vars":{},"WorkflowName":"Terraform"} -->